/* ---------------- 境界 ---------------- */
export const REALM_TREE = [
  ['炼气',   ['一层','二层','三层','四层','五层','六层','七层','八层','九层']],
  ['筑基',   ['初期','中期','后期']],
  ['金丹',   ['初期','中期','后期']],
  ['元婴',   ['初期','中期','后期']],
  ['化神',   ['初期','中期','后期']],
  ['炼虚',   ['前期','中期','后期']],
  ['合体',   ['前期','中期','后期']],
  ['大乘',   ['前期','中期','后期']],
  ['渡劫',   ['前期','中期','后期']],
  ['大罗金仙',['']],
  ['准圣',   ['初期','中期','后期']],
  ['圣人',   ['初期','中期','后期']],
  ['天道',   ['境']]
];
export const REALMS = [];
REALM_TREE.forEach((g, gi) => g[1].forEach((sub, i) => {
  REALMS.push({ name: g[0]+sub, group: gi, groupName: g[0], i });
}));
export const MAX_LV = REALMS.length - 1;
